app/controllers/comments_controller.rb

INSERT INTO `comments` (`content`, `prototype_id`, `user_id`, `created_at`, `updated_at`) VALUES ('投稿テスト', 4, 1, '2025-10-20 13:11:12.115361', '2025-10-20 13:11:12.115361')
---
  def create
    @comment=Comment.new(comment_params)
    if @comment.save