app/controllers/prototypes_controller.rb

  def index
    @prototypes=Prototype.includes(:user)
---
SELECT `prototypes`.* FROM `prototypes`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)

  def create
     @prototype=Prototype.create(prototype_params)
    if @prototype.save
---
INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('proto1_2', 'copy1_2', 'concept1_2', 2, '2025-10-21 00:59:01.371599', '2025-10-21 00:59:01.371599')
UPDATE `prototypes` SET `prototypes`.`updated_at` = '2025-10-21 00:59:01.391240' WHERE `prototypes`.`id` = 8

  def show
    @comment = Comment.new
    @comments = @prototype.comments.includes(:user)
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 7

  def update
    if @prototype.update(prototype_params)
---
UPDATE `prototypes` SET `prototypes`.`catch_copy` = 'chatched', `prototypes`.`concept` = 'concept2', `prototypes`.`updated_at` = '2025-10-18 09:33:43.920208' WHERE `prototypes`.`id` = 4

  def destroy
    prototype = Prototype.find(params[:id])
    prototype.destroy
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 7 LIMIT 1
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 7